Repository: ashehta700/Bibliography-app
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Library Reference
ar: رقم التقرير

source: Year of Issue
ar: تاريخ الإصدار

source: Report Type
ar: نوع التقرير

source: Title (EN)
ar: العنوان بللغة الانجليزية

source: Title (AR)
ar: العنوان بللغة العربية

source: Authors
ar: إسم مؤلف التقرير

source: Abstract (EN)
ar: ملخص التقرير بللغة الاتجليزية

source: Abstract (AR)
ar: ملخص التقرير بللغة العربية

source: Keywords
ar: الكلمات الافتتاحية

source: References
ar: المراجع

source: Upload PDF File
ar: تحميل الملف

source: Company
ar: إسم الشركة

source: Edit
ar: تعديــل

source: Add
ar: إضافة

source: Confirm Delete
ar: تأكيد الحــــذف

source: Are you sure you want to delete "%(report.Title)s"?
ar: هل انت متأكد من حذف هذا التقرير "%(report.Title)s"?

source: Yes, Delete
ar: نعم , حذف

source: Cancel
ar: عودة

source: Report
ar: تقرير

source: Appendices
ar: الملفات الملحقة

source: Appendix Name
ar: إسم الملف

source: Appendix File
ar: الملفات الملحقة

source: Notes
ar: ملاحظات

source: Type of Report
ar: نوع التقرير

source: Action
ar: الاعدادات

source: Delete
ar: حــــذف

source: Add Appendix
ar: إضافة ملف جديد

source: Save
ar: حفظ

source: Back to List
ar: العودة الى قائمة التقارير

source: Reports List
ar: قائمة جميع التقارير

source: Add Report
ar: إضافة تقرير جديد

source: Advanced Search
ar: البحث المتقدم

source: Report Company
ar: البحث باسم الشركة

source: All Companies
ar: كل الشركات

source: Report Author
ar: إسم مؤلف التقرير

source: Enter author name
ar: إدخل إسم المؤلف

source: Report ID
ar: رقم التقرير

source: Enter report ID
ar: إدخل رقم التقرير

source: Report Title
ar: عنوان التقرير

source: Enter report title
ar: إدخل عنوان التقرير

source: Enter report type
ar: إدخل رقم التقرير

source: Year
ar: السنة

source: Enter year eg. 2025 ..
ar: إدخل سنة التقرير مثال 2025 ..

source: Reset
ar: إعادة الضبط

source: Search
ar: إبحث

source: Actions
ar: الاعددات

source: Details
ar: تفاصيل

source: Related Documents in
ar: الملفات ذات الصلة

source: No related documents available.
ar: لا يوجد وثائق ذات صلة

source: No reports found.
ar: لا يوجد تقارير

source: Previous
ar: السابق

source: Next
ar: التالى

source: Saudi Geological Survey
ar: هيئة المساحة الجيولوجية

source: Home
ar: الصفحة الرئيسية

source: About Us
ar: نبذه عنا

source: Reports
ar: التقارير

source: Contact Us
ar: تواصل بنا

source: &copy; 2025 Saudi Geological Survey. All rights reserved.
ar: &copy; 2025 هيئة المساحة الجيولوجية. جميع الحقوق محفوظة.

source: Bibliographic Database
ar: قاعدة بيانات التقارير الفنية

source: Publications of Saudi Geological Survey including books, maps reports, technical reports and open file reports.
ar: منشورات هيئة المساحة الجيولوجية السعودية : الكتب والتقارير الفنية وتقارير الملفات المفتوحة.

source: Search by Title of the Report , or Report ID or keywords ....
ar: إبحث بعنوان الملف او برقم الملف او الكلمات الافتتاحية ....

source: Quick Search
ar: البحث السريع

source: Reset Filters
ar: إعادة الضبط

source: Top Reading
ar: الأكثر قراءة

source: number of reading
ar: عدد القراءات

source: No data available yet.
ar: لا يوجد وثائق ذات صلة

source: Instantly find reports by title or keywords.
ar: ابحث فورًا عن التقارير حسب العنوان أو الكلمات الرئيسية

source: PDF Reports
ar: التقارير

source: Access original and verified SGS geological documents.
ar: الوصول إلى الوثائق الجيولوجية الأصلية والموثقة من هيئة المساحة الجيولوجية .

source: Documents
ar: الوثائق

source: Browse a vast archive of official SGS reports.
ar: تصفح أرشيفًا ضخمًا من التقارير الرسمية لشركة لهيئة المساحة الجيولوجية.

source: Close
ar: إغلاق

source: All Report Types
ar: كل التقارير

source: Welcome!
ar: مرحباً !

source: Use the search form above to explore official SGS reports.!
ar: استخدم نموذج البحث أعلاه لاستكشاف التقارير الرسمية لهيئة المساحة الجيولوجية.!

source: Try adjusting your filters or search criteria and try again.
ar: حاول تعديل معايير البحث الخاصة بك وحاول مرة أخرى.

source: Found
ar: تم العثور على

source: results
ar: من نتائج البحث

source: Export CSV
ar: تصدير النتيجة

source: Appendix
ar: الملفات الملحقة

source: Related Appendix
ar: الملفات الملحقة

source: No appendices available
ar: لا يوجد وثائق ذات صلة

source: Detailed Report View
ar: تفاصيل بيانات التقرير

source: Report Number
ar: رقم التقرير

source: Type
ar: نوع التقرير

source: Author
ar: إسم مؤلف التقرير

source: Number of Reading
ar: عدد القراءات

source: Abstract
ar: ملخص التقرير

source: No Keywords Available.
ar: لا يوجد وثائق ذات صلة

source: No References Available.
ar: لا يوجد وثائق ذات صلة

source: Appendix Documents
ar: الملفات الملحقة

source: Main File
ar: التقرير الرئيسي

source: Files
ar: الملفات

source: Back to Home
ar: العودة الى الصفحة الرئيسية

source: Download PDF
ar: تحميل التقرير

source: Full Screen
ar: عرض الملف داخل شاشة كاملة
